Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/mpddrc.h
/*
 * Component description for MPDDRC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-04T10:37:14Z */
#ifndef _SAMA5D_MPDDRC_COMPONENT_H_
#define _SAMA5D_MPDDRC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR MPDDRC                                       */
/* ************************************************************************** */

/* -------- MPDDRC_MR : (MPDDRC Offset: 0x00) (R/W 32) Mode Register -------- */
#define MPDDRC_MR_MODE_Pos                    _UINT32_(0)                                          /* (MPDDRC_MR) MPDDRC Command Mode Position */
#define MPDDRC_MR_MODE_Msk                    (_UINT32_(0x7) << MPDDRC_MR_MODE_Pos)                /* (MPDDRC_MR) MPDDRC Command Mode Mask */
#define MPDDRC_MR_MODE(value)                 (MPDDRC_MR_MODE_Msk & (_UINT32_(value) << MPDDRC_MR_MODE_Pos)) /* Assigment of value for MODE in the MPDDRC_MR register */
#define   MPDDRC_MR_MODE_NORMAL_CMD_Val       _UINT32_(0x0)                                        /* (MPDDRC_MR) Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_NOP_CMD_Val          _UINT32_(0x1)                                        /* (MPDDRC_MR) The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_PRCGALL_CMD_Val      _UINT32_(0x2)                                        /* (MPDDRC_MR) The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.  */
#define   MPDDRC_MR_MODE_LMR_CMD_Val          _UINT32_(0x3)                                        /* (MPDDRC_MR) The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_RFSH_CMD_Val         _UINT32_(0x4)                                        /* (MPDDRC_MR) The MPDDRC issues an Autorefresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM.  */
#define   MPDDRC_MR_MODE_EXT_LMR_CMD_Val      _UINT32_(0x5)                                        /* (MPDDRC_MR) The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank.  */
#define   MPDDRC_MR_MODE_DEEP_CALIB_MD_Val    _UINT32_(0x6)                                        /* (MPDDRC_MR) Deep Power mode: Access to Deep Powerdown modeCalibration command: to calibrate RTT and RON values for the Process Voltage Temperature (PVT) (DDR3-SDRAM device)  */
#define   MPDDRC_MR_MODE_LPDDR2_LPDDR3_CMD_Val _UINT32_(0x7)                                        /* (MPDDRC_MR) The MPDDRC issues an LPDDR2/LPDDR3 Mode Register command when the device is accessed regardless of the cycle. To activate this mode, the Mode Register command must be followed by a write to the low-power DDR2-SDRAM or to the low-power DDR3-SDRAM.  */
#define MPDDRC_MR_MODE_NORMAL_CMD             (MPDDRC_MR_MODE_NORMAL_CMD_Val << MPDDRC_MR_MODE_Pos) /* (MPDDRC_MR) Normal Mode. Any access to the MPDDRC is decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_NOP_CMD                (MPDDRC_MR_MODE_NOP_CMD_Val << MPDDRC_MR_MODE_Pos)   /* (MPDDRC_MR) The MPDDRC issues a NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_PRCGALL_CMD            (MPDDRC_MR_MODE_PRCGALL_CMD_Val << MPDDRC_MR_MODE_Pos) /* (MPDDRC_MR) The MPDDRC issues the All Banks Precharge command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM. Position  */
#define MPDDRC_MR_MODE_LMR_CMD                (MPDDRC_MR_MODE_LMR_CMD_Val << MPDDRC_MR_MODE_Pos)   /* (MPDDRC_MR) The MPDDRC issues a Load Mode Register command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_RFSH_CMD               (MPDDRC_MR_MODE_RFSH_CMD_Val << MPDDRC_MR_MODE_Pos)  /* (MPDDRC_MR) The MPDDRC issues an Autorefresh command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an All Banks Precharge command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM. Position  */
#define MPDDRC_MR_MODE_EXT_LMR_CMD            (MPDDRC_MR_MODE_EXT_LMR_CMD_Val << MPDDRC_MR_MODE_Pos) /* (MPDDRC_MR) The MPDDRC issues an Extended Load Mode Register command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank. Position  */
#define MPDDRC_MR_MODE_DEEP_CALIB_MD          (MPDDRC_MR_MODE_DEEP_CALIB_MD_Val << MPDDRC_MR_MODE_Pos) /* (MPDDRC_MR) Deep Power mode: Access to Deep Powerdown modeCalibration command: to calibrate RTT and RON values for the Process Voltage Temperature (PVT) (DDR3-SDRAM device) Position  */
#define MPDDRC_MR_MODE_LPDDR2_LPDDR3_CMD      (MPDDRC_MR_MODE_LPDDR2_LPDDR3_CMD_Val << MPDDRC_MR_MODE_Pos) /* (MPDDRC_MR) The MPDDRC issues an LPDDR2/LPDDR3 Mode Register command when the device is accessed regardless of the cycle. To activate this mode, the Mode Register command must be followed by a write to the low-power DDR2-SDRAM or to the low-power DDR3-SDRAM. Position  */
#define MPDDRC_MR_DAI_Pos                     _UINT32_(4)                                          /* (MPDDRC_MR) Device Autoinitialization Status (read-only) Position */
#define MPDDRC_MR_DAI_Msk                     (_UINT32_(0x1) << MPDDRC_MR_DAI_Pos)                 /* (MPDDRC_MR) Device Autoinitialization Status (read-only) Mask */
#define MPDDRC_MR_DAI(value)                  (MPDDRC_MR_DAI_Msk & (_UINT32_(value) << MPDDRC_MR_DAI_Pos)) /* Assigment of value for DAI in the MPDDRC_MR register */
#define   MPDDRC_MR_DAI_DAI_COMPLETE_Val      _UINT32_(0x0)                                        /* (MPDDRC_MR) DAI complete  */
#define   MPDDRC_MR_DAI_DAI_IN_PROGESSS_Val   _UINT32_(0x1)                                        /* (MPDDRC_MR) DAI still in progress  */
#define MPDDRC_MR_DAI_DAI_COMPLETE            (MPDDRC_MR_DAI_DAI_COMPLETE_Val << MPDDRC_MR_DAI_Pos) /* (MPDDRC_MR) DAI complete Position  */
#define MPDDRC_MR_DAI_DAI_IN_PROGESSS         (MPDDRC_MR_DAI_DAI_IN_PROGESSS_Val << MPDDRC_MR_DAI_Pos) /* (MPDDRC_MR) DAI still in progress Position  */
#define MPDDRC_MR_MRS_Pos                     _UINT32_(8)                                          /* (MPDDRC_MR) Mode Register Select LPDDR2/LPDDR3 Position */
#define MPDDRC_MR_MRS_Msk                     (_UINT32_(0xFF) << MPDDRC_MR_MRS_Pos)                /* (MPDDRC_MR) Mode Register Select LPDDR2/LPDDR3 Mask */
#define MPDDRC_MR_MRS(value)                  (MPDDRC_MR_MRS_Msk & (_UINT32_(value) << MPDDRC_MR_MRS_Pos)) /* Assigment of value for MRS in the MPDDRC_MR register */
#define MPDDRC_MR_Msk                         _UINT32_(0x0000FF17)                                 /* (MPDDRC_MR) Register Mask  */


/* -------- MPDDRC_RTR : (MPDDRC Offset: 0x04) (R/W 32) Refresh Timer Register -------- */
#define MPDDRC_RTR_COUNT_Pos                  _UINT32_(0)                                          /* (MPDDRC_RTR) MPDDRC Refresh Timer Count Position */
#define MPDDRC_RTR_COUNT_Msk                  (_UINT32_(0xFFF) << MPDDRC_RTR_COUNT_Pos)            /* (MPDDRC_RTR) MPDDRC Refresh Timer Count Mask */
#define MPDDRC_RTR_COUNT(value)               (MPDDRC_RTR_COUNT_Msk & (_UINT32_(value) << MPDDRC_RTR_COUNT_Pos)) /* Assigment of value for COUNT in the MPDDRC_RTR register */
#define MPDDRC_RTR_ADJ_REF_Pos                _UINT32_(16)                                         /* (MPDDRC_RTR) Adjust Refresh Rate Position */
#define MPDDRC_RTR_ADJ_REF_Msk                (_UINT32_(0x1) << MPDDRC_RTR_ADJ_REF_Pos)            /* (MPDDRC_RTR) Adjust Refresh Rate Mask */
#define MPDDRC_RTR_ADJ_REF(value)             (MPDDRC_RTR_ADJ_REF_Msk & (_UINT32_(value) << MPDDRC_RTR_ADJ_REF_Pos)) /* Assigment of value for ADJ_REF in the MPDDRC_RTR register */
#define MPDDRC_RTR_REF_PB_Pos                 _UINT32_(17)                                         /* (MPDDRC_RTR) Refresh Per Bank Position */
#define MPDDRC_RTR_REF_PB_Msk                 (_UINT32_(0x1) << MPDDRC_RTR_REF_PB_Pos)             /* (MPDDRC_RTR) Refresh Per Bank Mask */
#define MPDDRC_RTR_REF_PB(value)              (MPDDRC_RTR_REF_PB_Msk & (_UINT32_(value) << MPDDRC_RTR_REF_PB_Pos)) /* Assigment of value for REF_PB in the MPDDRC_RTR register */
#define MPDDRC_RTR_MR4_VALUE_Pos              _UINT32_(20)                                         /* (MPDDRC_RTR) Content of MR4 Register (read-only) Position */
#define MPDDRC_RTR_MR4_VALUE_Msk              (_UINT32_(0x7) << MPDDRC_RTR_MR4_VALUE_Pos)          /* (MPDDRC_RTR) Content of MR4 Register (read-only) Mask */
#define MPDDRC_RTR_MR4_VALUE(value)           (MPDDRC_RTR_MR4_VALUE_Msk & (_UINT32_(value) << MPDDRC_RTR_MR4_VALUE_Pos)) /* Assigment of value for MR4_VALUE in the MPDDRC_RTR register */
#define MPDDRC_RTR_Msk                        _UINT32_(0x00730FFF)                                 /* (MPDDRC_RTR) Register Mask  */


