Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/mpddrc.h
/* -------- MPDDRC_MD : (MPDDRC Offset: 0x20) (R/W 32) Memory Device Register -------- */
#define MPDDRC_MD_MD_Pos                      _UINT32_(0)                                          /* (MPDDRC_MD) Memory Device Position */
#define MPDDRC_MD_MD_Msk                      (_UINT32_(0x7) << MPDDRC_MD_MD_Pos)                  /* (MPDDRC_MD) Memory Device Mask */
#define MPDDRC_MD_MD(value)                   (MPDDRC_MD_MD_Msk & (_UINT32_(value) << MPDDRC_MD_MD_Pos)) /* Assigment of value for MD in the MPDDRC_MD register */
#define   MPDDRC_MD_MD_LPDDR_SDRAM_Val        _UINT32_(0x3)                                        /* (MPDDRC_MD) Low-power DDR1-SDRAM  */
#define   MPDDRC_MD_MD_DDR3_SDRAM_Val         _UINT32_(0x4)                                        /* (MPDDRC_MD) DDR3-SDRAM  */
#define   MPDDRC_MD_MD_LPDDR3_SDRAM_Val       _UINT32_(0x5)                                        /* (MPDDRC_MD) Low-power DDR3-SDRAM  */
#define   MPDDRC_MD_MD_DDR2_SDRAM_Val         _UINT32_(0x6)                                        /* (MPDDRC_MD) DDR2-SDRAM  */
#define   MPDDRC_MD_MD_LPDDR2_SDRAM_Val       _UINT32_(0x7)                                        /* (MPDDRC_MD) Low-power DDR2-SDRAM  */
#define MPDDRC_MD_MD_LPDDR_SDRAM              (MPDDRC_MD_MD_LPDDR_SDRAM_Val << MPDDRC_MD_MD_Pos)   /* (MPDDRC_MD) Low-power DDR1-SDRAM Position  */
#define MPDDRC_MD_MD_DDR3_SDRAM               (MPDDRC_MD_MD_DDR3_SDRAM_Val << MPDDRC_MD_MD_Pos)    /* (MPDDRC_MD) DDR3-SDRAM Position  */
#define MPDDRC_MD_MD_LPDDR3_SDRAM             (MPDDRC_MD_MD_LPDDR3_SDRAM_Val << MPDDRC_MD_MD_Pos)  /* (MPDDRC_MD) Low-power DDR3-SDRAM Position  */
#define MPDDRC_MD_MD_DDR2_SDRAM               (MPDDRC_MD_MD_DDR2_SDRAM_Val << MPDDRC_MD_MD_Pos)    /* (MPDDRC_MD) DDR2-SDRAM Position  */
#define MPDDRC_MD_MD_LPDDR2_SDRAM             (MPDDRC_MD_MD_LPDDR2_SDRAM_Val << MPDDRC_MD_MD_Pos)  /* (MPDDRC_MD) Low-power DDR2-SDRAM Position  */
#define MPDDRC_MD_DBW_Pos                     _UINT32_(4)                                          /* (MPDDRC_MD) Data Bus Width Position */
#define MPDDRC_MD_DBW_Msk                     (_UINT32_(0x1) << MPDDRC_MD_DBW_Pos)                 /* (MPDDRC_MD) Data Bus Width Mask */
#define MPDDRC_MD_DBW(value)                  (MPDDRC_MD_DBW_Msk & (_UINT32_(value) << MPDDRC_MD_DBW_Pos)) /* Assigment of value for DBW in the MPDDRC_MD register */
#define   MPDDRC_MD_DBW_DBW_32_BITS_Val       _UINT32_(0x0)                                        /* (MPDDRC_MD) Data bus width is 32 bits  */
#define   MPDDRC_MD_DBW_DBW_16_BITS_Val       _UINT32_(0x1)                                        /* (MPDDRC_MD) Data bus width is 16 bits.  */
#define MPDDRC_MD_DBW_DBW_32_BITS             (MPDDRC_MD_DBW_DBW_32_BITS_Val << MPDDRC_MD_DBW_Pos) /* (MPDDRC_MD) Data bus width is 32 bits Position  */
#define MPDDRC_MD_DBW_DBW_16_BITS             (MPDDRC_MD_DBW_DBW_16_BITS_Val << MPDDRC_MD_DBW_Pos) /* (MPDDRC_MD) Data bus width is 16 bits. Position  */
#define MPDDRC_MD_WL_Pos                      _UINT32_(6)                                          /* (MPDDRC_MD) Write Latency (read-only) Position */
#define MPDDRC_MD_WL_Msk                      (_UINT32_(0x1) << MPDDRC_MD_WL_Pos)                  /* (MPDDRC_MD) Write Latency (read-only) Mask */
#define MPDDRC_MD_WL(value)                   (MPDDRC_MD_WL_Msk & (_UINT32_(value) << MPDDRC_MD_WL_Pos)) /* Assigment of value for WL in the MPDDRC_MD register */
#define   MPDDRC_MD_WL_WL_SETA_Val            _UINT32_(0x0)                                        /* (MPDDRC_MD) Write Latency Set A  */
#define   MPDDRC_MD_WL_WL_SETB_Val            _UINT32_(0x1)                                        /* (MPDDRC_MD) Write Latency Set B  */
#define MPDDRC_MD_WL_WL_SETA                  (MPDDRC_MD_WL_WL_SETA_Val << MPDDRC_MD_WL_Pos)       /* (MPDDRC_MD) Write Latency Set A Position  */
#define MPDDRC_MD_WL_WL_SETB                  (MPDDRC_MD_WL_WL_SETB_Val << MPDDRC_MD_WL_Pos)       /* (MPDDRC_MD) Write Latency Set B Position  */
#define MPDDRC_MD_RL3_Pos                     _UINT32_(7)                                          /* (MPDDRC_MD) Read Latency 3 Option Support (read-only) Position */
#define MPDDRC_MD_RL3_Msk                     (_UINT32_(0x1) << MPDDRC_MD_RL3_Pos)                 /* (MPDDRC_MD) Read Latency 3 Option Support (read-only) Mask */
#define MPDDRC_MD_RL3(value)                  (MPDDRC_MD_RL3_Msk & (_UINT32_(value) << MPDDRC_MD_RL3_Pos)) /* Assigment of value for RL3 in the MPDDRC_MD register */
#define   MPDDRC_MD_RL3_RL3_SUPPORT_Val       _UINT32_(0x0)                                        /* (MPDDRC_MD) Read latency of 3 is supported  */
#define   MPDDRC_MD_RL3_RL3_NOT_SUPPORTED_Val _UINT32_(0x1)                                        /* (MPDDRC_MD) Read latency 0f 3 is not supported  */
#define MPDDRC_MD_RL3_RL3_SUPPORT             (MPDDRC_MD_RL3_RL3_SUPPORT_Val << MPDDRC_MD_RL3_Pos) /* (MPDDRC_MD) Read latency of 3 is supported Position  */
#define MPDDRC_MD_RL3_RL3_NOT_SUPPORTED       (MPDDRC_MD_RL3_RL3_NOT_SUPPORTED_Val << MPDDRC_MD_RL3_Pos) /* (MPDDRC_MD) Read latency 0f 3 is not supported Position  */
#define MPDDRC_MD_MANU_ID_Pos                 _UINT32_(8)                                          /* (MPDDRC_MD) Manufacturer Identification (read-only) Position */
#define MPDDRC_MD_MANU_ID_Msk                 (_UINT32_(0xFF) << MPDDRC_MD_MANU_ID_Pos)            /* (MPDDRC_MD) Manufacturer Identification (read-only) Mask */
#define MPDDRC_MD_MANU_ID(value)              (MPDDRC_MD_MANU_ID_Msk & (_UINT32_(value) << MPDDRC_MD_MANU_ID_Pos)) /* Assigment of value for MANU_ID in the MPDDRC_MD register */
#define MPDDRC_MD_REV_ID_Pos                  _UINT32_(16)                                         /* (MPDDRC_MD) Revision Identification (read-only) Position */
#define MPDDRC_MD_REV_ID_Msk                  (_UINT32_(0xFF) << MPDDRC_MD_REV_ID_Pos)             /* (MPDDRC_MD) Revision Identification (read-only) Mask */
#define MPDDRC_MD_REV_ID(value)               (MPDDRC_MD_REV_ID_Msk & (_UINT32_(value) << MPDDRC_MD_REV_ID_Pos)) /* Assigment of value for REV_ID in the MPDDRC_MD register */
#define MPDDRC_MD_TYPE_Pos                    _UINT32_(24)                                         /* (MPDDRC_MD) DRAM Architecture (read-only) Position */
#define MPDDRC_MD_TYPE_Msk                    (_UINT32_(0x3) << MPDDRC_MD_TYPE_Pos)                /* (MPDDRC_MD) DRAM Architecture (read-only) Mask */
#define MPDDRC_MD_TYPE(value)                 (MPDDRC_MD_TYPE_Msk & (_UINT32_(value) << MPDDRC_MD_TYPE_Pos)) /* Assigment of value for TYPE in the MPDDRC_MD register */
#define   MPDDRC_MD_TYPE_S4_SDRAM_Val         _UINT32_(0x0)                                        /* (MPDDRC_MD) 4n prefetch architecture  */
#define   MPDDRC_MD_TYPE_S2_SDRAM_Val         _UINT32_(0x1)                                        /* (MPDDRC_MD) 2n prefetch architecture  */
#define   MPDDRC_MD_TYPE_NVM_Val              _UINT32_(0x2)                                        /* (MPDDRC_MD) Non-volatile device  */
#define   MPDDRC_MD_TYPE_S8_SDRAM_Val         _UINT32_(0x3)                                        /* (MPDDRC_MD) 8n prefetch architecture  */
#define MPDDRC_MD_TYPE_S4_SDRAM               (MPDDRC_MD_TYPE_S4_SDRAM_Val << MPDDRC_MD_TYPE_Pos)  /* (MPDDRC_MD) 4n prefetch architecture Position  */
#define MPDDRC_MD_TYPE_S2_SDRAM               (MPDDRC_MD_TYPE_S2_SDRAM_Val << MPDDRC_MD_TYPE_Pos)  /* (MPDDRC_MD) 2n prefetch architecture Position  */
#define MPDDRC_MD_TYPE_NVM                    (MPDDRC_MD_TYPE_NVM_Val << MPDDRC_MD_TYPE_Pos)       /* (MPDDRC_MD) Non-volatile device Position  */
#define MPDDRC_MD_TYPE_S8_SDRAM               (MPDDRC_MD_TYPE_S8_SDRAM_Val << MPDDRC_MD_TYPE_Pos)  /* (MPDDRC_MD) 8n prefetch architecture Position  */
#define MPDDRC_MD_DENSITY_Pos                 _UINT32_(26)                                         /* (MPDDRC_MD) Density of Memory (read-only) Position */
#define MPDDRC_MD_DENSITY_Msk                 (_UINT32_(0xF) << MPDDRC_MD_DENSITY_Pos)             /* (MPDDRC_MD) Density of Memory (read-only) Mask */
#define MPDDRC_MD_DENSITY(value)              (MPDDRC_MD_DENSITY_Msk & (_UINT32_(value) << MPDDRC_MD_DENSITY_Pos)) /* Assigment of value for DENSITY in the MPDDRC_MD register */
#define   MPDDRC_MD_DENSITY_DENSITY_64MBITS_Val _UINT32_(0x0)                                        /* (MPDDRC_MD) The device density is 64 Mbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_128MBITS_Val _UINT32_(0x1)                                        /* (MPDDRC_MD) The device density is 128 Mbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_256MBITS_Val _UINT32_(0x2)                                        /* (MPDDRC_MD) The device density is 256 Mbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_512MBITS_Val _UINT32_(0x3)                                        /* (MPDDRC_MD) The device density is 512 Mbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_1GBITS_Val _UINT32_(0x4)                                        /* (MPDDRC_MD) The device density is 1 Gbit.  */
#define   MPDDRC_MD_DENSITY_DENSITY_2GBITS_Val _UINT32_(0x5)                                        /* (MPDDRC_MD) The device density is 2 Gbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_4GBITS_Val _UINT32_(0x6)                                        /* (MPDDRC_MD) The device density is 4 Gbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_8GBITS_Val _UINT32_(0x7)                                        /* (MPDDRC_MD) The device density is 8 Gbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_16GBITS_Val _UINT32_(0x8)                                        /* (MPDDRC_MD) The device density is 16 Gbits.  */
#define   MPDDRC_MD_DENSITY_DENSITY_32GBITS_Val _UINT32_(0x9)                                        /* (MPDDRC_MD) The device density is 32 Gbits.  */
#define MPDDRC_MD_DENSITY_DENSITY_64MBITS     (MPDDRC_MD_DENSITY_DENSITY_64MBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 64 Mbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_128MBITS    (MPDDRC_MD_DENSITY_DENSITY_128MBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 128 Mbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_256MBITS    (MPDDRC_MD_DENSITY_DENSITY_256MBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 256 Mbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_512MBITS    (MPDDRC_MD_DENSITY_DENSITY_512MBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 512 Mbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_1GBITS      (MPDDRC_MD_DENSITY_DENSITY_1GBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 1 Gbit. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_2GBITS      (MPDDRC_MD_DENSITY_DENSITY_2GBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 2 Gbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_4GBITS      (MPDDRC_MD_DENSITY_DENSITY_4GBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 4 Gbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_8GBITS      (MPDDRC_MD_DENSITY_DENSITY_8GBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 8 Gbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_16GBITS     (MPDDRC_MD_DENSITY_DENSITY_16GBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 16 Gbits. Position  */
#define MPDDRC_MD_DENSITY_DENSITY_32GBITS     (MPDDRC_MD_DENSITY_DENSITY_32GBITS_Val << MPDDRC_MD_DENSITY_Pos) /* (MPDDRC_MD) The device density is 32 Gbits. Position  */
#define MPDDRC_MD_IO_WIDTH_Pos                _UINT32_(30)                                         /* (MPDDRC_MD) Width of Memory (read-only) Position */
#define MPDDRC_MD_IO_WIDTH_Msk                (_UINT32_(0x3) << MPDDRC_MD_IO_WIDTH_Pos)            /* (MPDDRC_MD) Width of Memory (read-only) Mask */
#define MPDDRC_MD_IO_WIDTH(value)             (MPDDRC_MD_IO_WIDTH_Msk & (_UINT32_(value) << MPDDRC_MD_IO_WIDTH_Pos)) /* Assigment of value for IO_WIDTH in the MPDDRC_MD register */
#define   MPDDRC_MD_IO_WIDTH_WIDTH_32_Val     _UINT32_(0x0)                                        /* (MPDDRC_MD) The data bus width is 32 bits.  */
#define   MPDDRC_MD_IO_WIDTH_WIDTH_16_Val     _UINT32_(0x1)                                        /* (MPDDRC_MD) The data bus width is 16 bits.  */
#define   MPDDRC_MD_IO_WIDTH_WIDTH_8_Val      _UINT32_(0x2)                                        /* (MPDDRC_MD) The data bus width is 8 bits.  */
#define   MPDDRC_MD_IO_WIDTH_NOT_USED_Val     _UINT32_(0x3)                                        /* (MPDDRC_MD) -  */
#define MPDDRC_MD_IO_WIDTH_WIDTH_32           (MPDDRC_MD_IO_WIDTH_WIDTH_32_Val << MPDDRC_MD_IO_WIDTH_Pos) /* (MPDDRC_MD) The data bus width is 32 bits. Position  */
#define MPDDRC_MD_IO_WIDTH_WIDTH_16           (MPDDRC_MD_IO_WIDTH_WIDTH_16_Val << MPDDRC_MD_IO_WIDTH_Pos) /* (MPDDRC_MD) The data bus width is 16 bits. Position  */
#define MPDDRC_MD_IO_WIDTH_WIDTH_8            (MPDDRC_MD_IO_WIDTH_WIDTH_8_Val << MPDDRC_MD_IO_WIDTH_Pos) /* (MPDDRC_MD) The data bus width is 8 bits. Position  */
#define MPDDRC_MD_IO_WIDTH_NOT_USED           (MPDDRC_MD_IO_WIDTH_NOT_USED_Val << MPDDRC_MD_IO_WIDTH_Pos) /* (MPDDRC_MD) - Position  */
#define MPDDRC_MD_Msk                         _UINT32_(0xFFFFFFD7)                                 /* (MPDDRC_MD) Register Mask  */

