Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/mpddrc.h
/* -------- MPDDRC_OCMS_KEY1 : (MPDDRC Offset: 0x3C) ( /W 32) OCMS KEY1 Register -------- */
#define MPDDRC_OCMS_KEY1_KEY1_Pos             _UINT32_(0)                                          /* (MPDDRC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Position */
#define MPDDRC_OCMS_KEY1_KEY1_Msk             (_UINT32_(0xFFFFFFFF) << MPDDRC_OCMS_KEY1_KEY1_Pos)  /* (MPDDRC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define MPDDRC_OCMS_KEY1_KEY1(value)          (MPDDRC_OCMS_KEY1_KEY1_Msk & (_UINT32_(value) << MPDDRC_OCMS_KEY1_KEY1_Pos)) /* Assigment of value for KEY1 in the MPDDRC_OCMS_KEY1 register */
#define MPDDRC_OCMS_KEY1_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_OCMS_KEY1) Register Mask  */


/* -------- MPDDRC_OCMS_KEY2 : (MPDDRC Offset: 0x40) ( /W 32) OCMS KEY2 Register -------- */
#define MPDDRC_OCMS_KEY2_KEY2_Pos             _UINT32_(0)                                          /* (MPDDRC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Position */
#define MPDDRC_OCMS_KEY2_KEY2_Msk             (_UINT32_(0xFFFFFFFF) << MPDDRC_OCMS_KEY2_KEY2_Pos)  /* (MPDDRC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define MPDDRC_OCMS_KEY2_KEY2(value)          (MPDDRC_OCMS_KEY2_KEY2_Msk & (_UINT32_(value) << MPDDRC_OCMS_KEY2_KEY2_Pos)) /* Assigment of value for KEY2 in the MPDDRC_OCMS_KEY2 register */
#define MPDDRC_OCMS_KEY2_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_OCMS_KEY2) Register Mask  */


/* -------- MPDDRC_CONF_ARBITER : (MPDDRC Offset: 0x44) (R/W 32) Configuration Arbiter Register -------- */
#define MPDDRC_CONF_ARBITER_ARB_Pos           _UINT32_(0)                                          /* (MPDDRC_CONF_ARBITER) Type of Arbitration Position */
#define MPDDRC_CONF_ARBITER_ARB_Msk           (_UINT32_(0x3) << MPDDRC_CONF_ARBITER_ARB_Pos)       /* (MPDDRC_CONF_ARBITER) Type of Arbitration Mask */
#define MPDDRC_CONF_ARBITER_ARB(value)        (MPDDRC_CONF_ARBITER_ARB_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_ARB_Pos)) /* Assigment of value for ARB in the MPDDRC_CONF_ARBITER register */
#define   MPDDRC_CONF_ARBITER_ARB_ROUND_Val   _UINT32_(0x0)                                        /* (MPDDRC_CONF_ARBITER) Round Robin  */
#define   MPDDRC_CONF_ARBITER_ARB_NB_REQUEST_Val _UINT32_(0x1)                                        /* (MPDDRC_CONF_ARBITER) Request Policy  */
#define   MPDDRC_CONF_ARBITER_ARB_BANDWIDTH_Val _UINT32_(0x2)                                        /* (MPDDRC_CONF_ARBITER) Bandwidth Policy  */
#define MPDDRC_CONF_ARBITER_ARB_ROUND         (MPDDRC_CONF_ARBITER_ARB_ROUND_Val << MPDDRC_CONF_ARBITER_ARB_Pos) /* (MPDDRC_CONF_ARBITER) Round Robin Position  */
#define MPDDRC_CONF_ARBITER_ARB_NB_REQUEST    (MPDDRC_CONF_ARBITER_ARB_NB_REQUEST_Val << MPDDRC_CONF_ARBITER_ARB_Pos) /* (MPDDRC_CONF_ARBITER) Request Policy Position  */
#define MPDDRC_CONF_ARBITER_ARB_BANDWIDTH     (MPDDRC_CONF_ARBITER_ARB_BANDWIDTH_Val << MPDDRC_CONF_ARBITER_ARB_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth Policy Position  */
#define MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Pos   _UINT32_(3)                                          /* (MPDDRC_CONF_ARBITER) Bandwidth Max or Current Position */
#define MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Msk   (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth Max or Current Mask */
#define MPDDRC_CONF_ARBITER_BDW_MAX_CUR(value) (MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_MAX_CUR_Pos)) /* Assigment of value for BDW_MAX_CUR in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P0_Pos      _UINT32_(8)                                          /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P0_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P0_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P0(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P0_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P0_Pos)) /* Assigment of value for RQ_WD_P0 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P1_Pos      _UINT32_(9)                                          /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P1_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P1_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P1(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P1_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P1_Pos)) /* Assigment of value for RQ_WD_P1 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P2_Pos      _UINT32_(10)                                         /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P2_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P2_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P2(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P2_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P2_Pos)) /* Assigment of value for RQ_WD_P2 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P3_Pos      _UINT32_(11)                                         /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P3_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P3_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P3(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P3_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P3_Pos)) /* Assigment of value for RQ_WD_P3 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P4_Pos      _UINT32_(12)                                         /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P4_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P4_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P4(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P4_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P4_Pos)) /* Assigment of value for RQ_WD_P4 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P5_Pos      _UINT32_(13)                                         /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P5_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P5_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P5(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P5_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P5_Pos)) /* Assigment of value for RQ_WD_P5 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P6_Pos      _UINT32_(14)                                         /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P6_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P6_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P6(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P6_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P6_Pos)) /* Assigment of value for RQ_WD_P6 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_RQ_WD_P7_Pos      _UINT32_(15)                                         /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Position */
#define MPDDRC_CONF_ARBITER_RQ_WD_P7_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_RQ_WD_P7_Pos)  /* (MPDDRC_CONF_ARBITER) Request or Word from Port X Mask */
#define MPDDRC_CONF_ARBITER_RQ_WD_P7(value)   (MPDDRC_CONF_ARBITER_RQ_WD_P7_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P7_Pos)) /* Assigment of value for RQ_WD_P7 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P0_Pos      _UINT32_(16)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P0_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P0_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P0(value)   (MPDDRC_CONF_ARBITER_MA_PR_P0_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P0_Pos)) /* Assigment of value for MA_PR_P0 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P1_Pos      _UINT32_(17)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P1_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P1_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P1(value)   (MPDDRC_CONF_ARBITER_MA_PR_P1_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P1_Pos)) /* Assigment of value for MA_PR_P1 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P2_Pos      _UINT32_(18)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P2_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P2_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P2(value)   (MPDDRC_CONF_ARBITER_MA_PR_P2_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P2_Pos)) /* Assigment of value for MA_PR_P2 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P3_Pos      _UINT32_(19)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P3_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P3_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P3(value)   (MPDDRC_CONF_ARBITER_MA_PR_P3_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P3_Pos)) /* Assigment of value for MA_PR_P3 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P4_Pos      _UINT32_(20)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P4_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P4_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P4(value)   (MPDDRC_CONF_ARBITER_MA_PR_P4_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P4_Pos)) /* Assigment of value for MA_PR_P4 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P5_Pos      _UINT32_(21)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P5_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P5_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P5(value)   (MPDDRC_CONF_ARBITER_MA_PR_P5_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P5_Pos)) /* Assigment of value for MA_PR_P5 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P6_Pos      _UINT32_(22)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P6_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P6_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P6(value)   (MPDDRC_CONF_ARBITER_MA_PR_P6_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P6_Pos)) /* Assigment of value for MA_PR_P6 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_MA_PR_P7_Pos      _UINT32_(23)                                         /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Position */
#define MPDDRC_CONF_ARBITER_MA_PR_P7_Msk      (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_MA_PR_P7_Pos)  /* (MPDDRC_CONF_ARBITER) Master or Software Provide Information Mask */
#define MPDDRC_CONF_ARBITER_MA_PR_P7(value)   (MPDDRC_CONF_ARBITER_MA_PR_P7_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P7_Pos)) /* Assigment of value for MA_PR_P7 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P0_Pos  _UINT32_(24)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P0_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P0_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P0(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P0_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P0_Pos)) /* Assigment of value for BDW_BURST_P0 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P1_Pos  _UINT32_(25)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P1_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P1_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P1(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P1_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P1_Pos)) /* Assigment of value for BDW_BURST_P1 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P2_Pos  _UINT32_(26)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P2_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P2_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P2(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P2_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P2_Pos)) /* Assigment of value for BDW_BURST_P2 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P3_Pos  _UINT32_(27)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P3_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P3_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P3(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P3_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P3_Pos)) /* Assigment of value for BDW_BURST_P3 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P4_Pos  _UINT32_(28)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P4_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P4_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P4(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P4_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P4_Pos)) /* Assigment of value for BDW_BURST_P4 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P5_Pos  _UINT32_(29)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P5_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P5_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P5(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P5_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P5_Pos)) /* Assigment of value for BDW_BURST_P5 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P6_Pos  _UINT32_(30)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P6_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P6_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P6(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P6_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P6_Pos)) /* Assigment of value for BDW_BURST_P6 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P7_Pos  _UINT32_(31)                                         /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Position */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P7_Msk  (_UINT32_(0x1) << MPDDRC_CONF_ARBITER_BDW_BURST_P7_Pos) /* (MPDDRC_CONF_ARBITER) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X Mask */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P7(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P7_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P7_Pos)) /* Assigment of value for BDW_BURST_P7 in the MPDDRC_CONF_ARBITER register */
#define MPDDRC_CONF_ARBITER_Msk               _UINT32_(0xFFFFFF0B)                                 /* (MPDDRC_CONF_ARBITER) Register Mask  */

#define MPDDRC_CONF_ARBITER_RQ_WD_P_Pos       _UINT32_(8)                                          /* (MPDDRC_CONF_ARBITER Position) Request or Word from Port X */
#define MPDDRC_CONF_ARBITER_RQ_WD_P_Msk       (_UINT32_(0xFF) << MPDDRC_CONF_ARBITER_RQ_WD_P_Pos)  /* (MPDDRC_CONF_ARBITER Mask) RQ_WD_P */
#define MPDDRC_CONF_ARBITER_RQ_WD_P(value)    (MPDDRC_CONF_ARBITER_RQ_WD_P_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_RQ_WD_P_Pos)) 
#define MPDDRC_CONF_ARBITER_MA_PR_P_Pos       _UINT32_(16)                                         /* (MPDDRC_CONF_ARBITER Position) Master or Software Provide Information */
#define MPDDRC_CONF_ARBITER_MA_PR_P_Msk       (_UINT32_(0xFF) << MPDDRC_CONF_ARBITER_MA_PR_P_Pos)  /* (MPDDRC_CONF_ARBITER Mask) MA_PR_P */
#define MPDDRC_CONF_ARBITER_MA_PR_P(value)    (MPDDRC_CONF_ARBITER_MA_PR_P_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_MA_PR_P_Pos)) 
#define MPDDRC_CONF_ARBITER_BDW_BURST_P_Pos   _UINT32_(24)                                         /* (MPDDRC_CONF_ARBITER Position) Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P_Msk   (_UINT32_(0xFF) << MPDDRC_CONF_ARBITER_BDW_BURST_P_Pos) /* (MPDDRC_CONF_ARBITER Mask) BDW_BURST_P */
#define MPDDRC_CONF_ARBITER_BDW_BURST_P(value) (MPDDRC_CONF_ARBITER_BDW_BURST_P_Msk & (_UINT32_(value) << MPDDRC_CONF_ARBITER_BDW_BURST_P_Pos)) 

/* -------- MPDDRC_TIMEOUT : (MPDDRC Offset: 0x48) (R/W 32) Timeout Register -------- */
#define MPDDRC_TIMEOUT_TIMEOUT_P0_Pos         _UINT32_(0)                                          /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P0_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P0_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P0(value)      (MPDDRC_TIMEOUT_TIMEOUT_P0_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P0_Pos)) /* Assigment of value for TIMEOUT_P0 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_TIMEOUT_P1_Pos         _UINT32_(4)                                          /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P1_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P1_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P1(value)      (MPDDRC_TIMEOUT_TIMEOUT_P1_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P1_Pos)) /* Assigment of value for TIMEOUT_P1 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_TIMEOUT_P2_Pos         _UINT32_(8)                                          /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P2_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P2_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P2(value)      (MPDDRC_TIMEOUT_TIMEOUT_P2_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P2_Pos)) /* Assigment of value for TIMEOUT_P2 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_TIMEOUT_P3_Pos         _UINT32_(12)                                         /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P3_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P3_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P3(value)      (MPDDRC_TIMEOUT_TIMEOUT_P3_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P3_Pos)) /* Assigment of value for TIMEOUT_P3 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_TIMEOUT_P4_Pos         _UINT32_(16)                                         /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P4_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P4_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P4(value)      (MPDDRC_TIMEOUT_TIMEOUT_P4_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P4_Pos)) /* Assigment of value for TIMEOUT_P4 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_TIMEOUT_P5_Pos         _UINT32_(20)                                         /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P5_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P5_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P5(value)      (MPDDRC_TIMEOUT_TIMEOUT_P5_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P5_Pos)) /* Assigment of value for TIMEOUT_P5 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_TIMEOUT_P6_Pos         _UINT32_(24)                                         /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P6_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P6_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P6(value)      (MPDDRC_TIMEOUT_TIMEOUT_P6_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P6_Pos)) /* Assigment of value for TIMEOUT_P6 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_TIMEOUT_P7_Pos         _UINT32_(28)                                         /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Position */
#define MPDDRC_TIMEOUT_TIMEOUT_P7_Msk         (_UINT32_(0xF) << MPDDRC_TIMEOUT_TIMEOUT_P7_Pos)     /* (MPDDRC_TIMEOUT) Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7 Mask */
#define MPDDRC_TIMEOUT_TIMEOUT_P7(value)      (MPDDRC_TIMEOUT_TIMEOUT_P7_Msk & (_UINT32_(value) << MPDDRC_TIMEOUT_TIMEOUT_P7_Pos)) /* Assigment of value for TIMEOUT_P7 in the MPDDRC_TIMEOUT register */
#define MPDDRC_TIMEOUT_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_TIMEOUT) Register Mask  */


