Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/mpddrc.h
/* -------- MPDDRC_REQ_PORT_0123 : (MPDDRC Offset: 0x4C) (R/W 32) Request Port 0-1-2-3 Register -------- */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P0_Pos _UINT32_(0)                                          /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Position */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P0_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P0_Pos) /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Mask */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P0(value) (MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P0_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P0_Pos)) /* Assigment of value for NRQ_NWD_BDW_P0 in the MPDDRC_REQ_PORT_0123 register */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P1_Pos _UINT32_(8)                                          /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Position */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P1_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P1_Pos) /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Mask */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P1(value) (MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P1_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P1_Pos)) /* Assigment of value for NRQ_NWD_BDW_P1 in the MPDDRC_REQ_PORT_0123 register */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P2_Pos _UINT32_(16)                                         /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Position */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P2_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P2_Pos) /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Mask */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P2(value) (MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P2_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P2_Pos)) /* Assigment of value for NRQ_NWD_BDW_P2 in the MPDDRC_REQ_PORT_0123 register */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P3_Pos _UINT32_(24)                                         /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Position */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P3_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P3_Pos) /* (MPDDRC_REQ_PORT_0123) Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3 Mask */
#define MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P3(value) (MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P3_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_0123_NRQ_NWD_BDW_P3_Pos)) /* Assigment of value for NRQ_NWD_BDW_P3 in the MPDDRC_REQ_PORT_0123 register */
#define MPDDRC_REQ_PORT_0123_Msk              _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_REQ_PORT_0123) Register Mask  */


/* -------- MPDDRC_REQ_PORT_4567 : (MPDDRC Offset: 0x50) (R/W 32) Request Port 4-5-6-7 Register -------- */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Pos _UINT32_(0)                                          /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Pos) /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P4_Pos)) /* Assigment of value for NRQ_NWD_BDW_P4 in the MPDDRC_REQ_PORT_4567 register */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Pos _UINT32_(8)                                          /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Pos) /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P5_Pos)) /* Assigment of value for NRQ_NWD_BDW_P5 in the MPDDRC_REQ_PORT_4567 register */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Pos _UINT32_(16)                                         /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Pos) /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P6_Pos)) /* Assigment of value for NRQ_NWD_BDW_P6 in the MPDDRC_REQ_PORT_4567 register */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Pos _UINT32_(24)                                         /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Position */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Msk (_UINT32_(0xFF) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Pos) /* (MPDDRC_REQ_PORT_4567) Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7 Mask */
#define MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7(value) (MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Msk & (_UINT32_(value) << MPDDRC_REQ_PORT_4567_NRQ_NWD_BDW_P7_Pos)) /* Assigment of value for NRQ_NWD_BDW_P7 in the MPDDRC_REQ_PORT_4567 register */
#define MPDDRC_REQ_PORT_4567_Msk              _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_REQ_PORT_4567) Register Mask  */


/* -------- MPDDRC_BDW_PORT_0123 : (MPDDRC Offset: 0x54) ( R/ 32) Current/Maximum Bandwidth Port 0-1-2-3 Register -------- */
#define MPDDRC_BDW_PORT_0123_BDW_P0_Pos       _UINT32_(0)                                          /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P0_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P0_Pos)  /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P0(value)    (MPDDRC_BDW_PORT_0123_BDW_P0_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_0123_BDW_P0_Pos)) /* Assigment of value for BDW_P0 in the MPDDRC_BDW_PORT_0123 register */
#define MPDDRC_BDW_PORT_0123_BDW_P1_Pos       _UINT32_(8)                                          /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P1_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P1_Pos)  /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P1(value)    (MPDDRC_BDW_PORT_0123_BDW_P1_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_0123_BDW_P1_Pos)) /* Assigment of value for BDW_P1 in the MPDDRC_BDW_PORT_0123 register */
#define MPDDRC_BDW_PORT_0123_BDW_P2_Pos       _UINT32_(16)                                         /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P2_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P2_Pos)  /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P2(value)    (MPDDRC_BDW_PORT_0123_BDW_P2_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_0123_BDW_P2_Pos)) /* Assigment of value for BDW_P2 in the MPDDRC_BDW_PORT_0123 register */
#define MPDDRC_BDW_PORT_0123_BDW_P3_Pos       _UINT32_(24)                                         /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Position */
#define MPDDRC_BDW_PORT_0123_BDW_P3_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_0123_BDW_P3_Pos)  /* (MPDDRC_BDW_PORT_0123) Current/Maximum Bandwidth from Port 0-1-2-3 Mask */
#define MPDDRC_BDW_PORT_0123_BDW_P3(value)    (MPDDRC_BDW_PORT_0123_BDW_P3_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_0123_BDW_P3_Pos)) /* Assigment of value for BDW_P3 in the MPDDRC_BDW_PORT_0123 register */
#define MPDDRC_BDW_PORT_0123_Msk              _UINT32_(0x7F7F7F7F)                                 /* (MPDDRC_BDW_PORT_0123) Register Mask  */


/* -------- MPDDRC_BDW_PORT_4567 : (MPDDRC Offset: 0x58) ( R/ 32) Current/Maximum Bandwidth Port 4-5-6-7 Register -------- */
#define MPDDRC_BDW_PORT_4567_BDW_P4_Pos       _UINT32_(0)                                          /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P4_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P4_Pos)  /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P4(value)    (MPDDRC_BDW_PORT_4567_BDW_P4_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_4567_BDW_P4_Pos)) /* Assigment of value for BDW_P4 in the MPDDRC_BDW_PORT_4567 register */
#define MPDDRC_BDW_PORT_4567_BDW_P5_Pos       _UINT32_(8)                                          /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P5_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P5_Pos)  /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P5(value)    (MPDDRC_BDW_PORT_4567_BDW_P5_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_4567_BDW_P5_Pos)) /* Assigment of value for BDW_P5 in the MPDDRC_BDW_PORT_4567 register */
#define MPDDRC_BDW_PORT_4567_BDW_P6_Pos       _UINT32_(16)                                         /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P6_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P6_Pos)  /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P6(value)    (MPDDRC_BDW_PORT_4567_BDW_P6_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_4567_BDW_P6_Pos)) /* Assigment of value for BDW_P6 in the MPDDRC_BDW_PORT_4567 register */
#define MPDDRC_BDW_PORT_4567_BDW_P7_Pos       _UINT32_(24)                                         /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Position */
#define MPDDRC_BDW_PORT_4567_BDW_P7_Msk       (_UINT32_(0x7F) << MPDDRC_BDW_PORT_4567_BDW_P7_Pos)  /* (MPDDRC_BDW_PORT_4567) Current/Maximum Bandwidth from Port 4-5-6-7 Mask */
#define MPDDRC_BDW_PORT_4567_BDW_P7(value)    (MPDDRC_BDW_PORT_4567_BDW_P7_Msk & (_UINT32_(value) << MPDDRC_BDW_PORT_4567_BDW_P7_Pos)) /* Assigment of value for BDW_P7 in the MPDDRC_BDW_PORT_4567 register */
#define MPDDRC_BDW_PORT_4567_Msk              _UINT32_(0x7F7F7F7F)                                 /* (MPDDRC_BDW_PORT_4567) Register Mask  */


/* -------- MPDDRC_RD_DATA_PATH : (MPDDRC Offset: 0x5C) (R/W 32) Read Data Path Register -------- */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos _UINT32_(0)                                          /* (MPDDRC_RD_DATA_PATH) Shift Sampling Point of Data Position */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Msk (_UINT32_(0x3) << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /* (MPDDRC_RD_DATA_PATH) Shift Sampling Point of Data Mask */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING(value) (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Msk & (_UINT32_(value) << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos)) /* Assigment of value for SHIFT_SAMPLING in the MPDDRC_RD_DATA_PATH register */
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_NO_SHIFT_Val _UINT32_(0x0)                                        /* (MPDDRC_RD_DATA_PATH) Initial sampling point.  */
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_ONE_CYCLE_Val _UINT32_(0x1)                                        /* (MPDDRC_RD_DATA_PATH) Sampling point is shifted by one cycle.  */
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_TWO_CYCLES_Val _UINT32_(0x2)                                        /* (MPDDRC_RD_DATA_PATH) Sampling point is shifted by two cycles.  */
#define   MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_THREE_CYCLES_Val _UINT32_(0x3)                                        /* (MPDDRC_RD_DATA_PATH) Sampling point is shifted by three cycles, unique for LPDDR2 and DDR3 and LPDDR3.Not applicable for DDR2 and LPDDR1 devices.  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_NO_SHIFT (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_NO_SHIFT_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /* (MPDDRC_RD_DATA_PATH) Initial sampling point. Position  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_ONE_CYCLE (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_ONE_CYCLE_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /* (MPDDRC_RD_DATA_PATH) Sampling point is shifted by one cycle. Position  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_TWO_CYCLES (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_TWO_CYCLES_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /* (MPDDRC_RD_DATA_PATH) Sampling point is shifted by two cycles. Position  */
#define MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_THREE_CYCLES (MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_SHIFT_THREE_CYCLES_Val << MPDDRC_RD_DATA_PATH_SHIFT_SAMPLING_Pos) /* (MPDDRC_RD_DATA_PATH) Sampling point is shifted by three cycles, unique for LPDDR2 and DDR3 and LPDDR3.Not applicable for DDR2 and LPDDR1 devices. Position  */
#define MPDDRC_RD_DATA_PATH_Msk               _UINT32_(0x00000003)                                 /* (MPDDRC_RD_DATA_PATH) Register Mask  */


/* -------- MPDDRC_MCFGR : (MPDDRC Offset: 0x60) (R/W 32) Monitor Configuration Register -------- */
#define MPDDRC_MCFGR_EN_MONI_Pos              _UINT32_(0)                                          /* (MPDDRC_MCFGR) Enable Monitor Position */
#define MPDDRC_MCFGR_EN_MONI_Msk              (_UINT32_(0x1) << MPDDRC_MCFGR_EN_MONI_Pos)          /* (MPDDRC_MCFGR) Enable Monitor Mask */
#define MPDDRC_MCFGR_EN_MONI(value)           (MPDDRC_MCFGR_EN_MONI_Msk & (_UINT32_(value) << MPDDRC_MCFGR_EN_MONI_Pos)) /* Assigment of value for EN_MONI in the MPDDRC_MCFGR register */
#define MPDDRC_MCFGR_SOFT_RESET_Pos           _UINT32_(1)                                          /* (MPDDRC_MCFGR) Soft Reset Position */
#define MPDDRC_MCFGR_SOFT_RESET_Msk           (_UINT32_(0x1) << MPDDRC_MCFGR_SOFT_RESET_Pos)       /* (MPDDRC_MCFGR) Soft Reset Mask */
#define MPDDRC_MCFGR_SOFT_RESET(value)        (MPDDRC_MCFGR_SOFT_RESET_Msk & (_UINT32_(value) << MPDDRC_MCFGR_SOFT_RESET_Pos)) /* Assigment of value for SOFT_RESET in the MPDDRC_MCFGR register */
#define MPDDRC_MCFGR_RUN_Pos                  _UINT32_(4)                                          /* (MPDDRC_MCFGR) Control Monitor Position */
#define MPDDRC_MCFGR_RUN_Msk                  (_UINT32_(0x1) << MPDDRC_MCFGR_RUN_Pos)              /* (MPDDRC_MCFGR) Control Monitor Mask */
#define MPDDRC_MCFGR_RUN(value)               (MPDDRC_MCFGR_RUN_Msk & (_UINT32_(value) << MPDDRC_MCFGR_RUN_Pos)) /* Assigment of value for RUN in the MPDDRC_MCFGR register */
#define MPDDRC_MCFGR_READ_WRITE_Pos           _UINT32_(8)                                          /* (MPDDRC_MCFGR) Read/Write Access Position */
#define MPDDRC_MCFGR_READ_WRITE_Msk           (_UINT32_(0x3) << MPDDRC_MCFGR_READ_WRITE_Pos)       /* (MPDDRC_MCFGR) Read/Write Access Mask */
#define MPDDRC_MCFGR_READ_WRITE(value)        (MPDDRC_MCFGR_READ_WRITE_Msk & (_UINT32_(value) << MPDDRC_MCFGR_READ_WRITE_Pos)) /* Assigment of value for READ_WRITE in the MPDDRC_MCFGR register */
#define   MPDDRC_MCFGR_READ_WRITE_TRIG_RD_WR_Val _UINT32_(0x0)                                        /* (MPDDRC_MCFGR) Read and Write accesses are triggered.  */
#define   MPDDRC_MCFGR_READ_WRITE_TRIG_WR_Val _UINT32_(0x1)                                        /* (MPDDRC_MCFGR) Only Write accesses are triggered.  */
#define   MPDDRC_MCFGR_READ_WRITE_TRIG_RD_Val _UINT32_(0x2)                                        /* (MPDDRC_MCFGR) Only Read accesses are triggered.  */
#define MPDDRC_MCFGR_READ_WRITE_TRIG_RD_WR    (MPDDRC_MCFGR_READ_WRITE_TRIG_RD_WR_Val << MPDDRC_MCFGR_READ_WRITE_Pos) /* (MPDDRC_MCFGR) Read and Write accesses are triggered. Position  */
#define MPDDRC_MCFGR_READ_WRITE_TRIG_WR       (MPDDRC_MCFGR_READ_WRITE_TRIG_WR_Val << MPDDRC_MCFGR_READ_WRITE_Pos) /* (MPDDRC_MCFGR) Only Write accesses are triggered. Position  */
#define MPDDRC_MCFGR_READ_WRITE_TRIG_RD       (MPDDRC_MCFGR_READ_WRITE_TRIG_RD_Val << MPDDRC_MCFGR_READ_WRITE_Pos) /* (MPDDRC_MCFGR) Only Read accesses are triggered. Position  */
#define MPDDRC_MCFGR_REFR_CALIB_Pos           _UINT32_(10)                                         /* (MPDDRC_MCFGR) Refresh Calibration Position */
#define MPDDRC_MCFGR_REFR_CALIB_Msk           (_UINT32_(0x1) << MPDDRC_MCFGR_REFR_CALIB_Pos)       /* (MPDDRC_MCFGR) Refresh Calibration Mask */
#define MPDDRC_MCFGR_REFR_CALIB(value)        (MPDDRC_MCFGR_REFR_CALIB_Msk & (_UINT32_(value) << MPDDRC_MCFGR_REFR_CALIB_Pos)) /* Assigment of value for REFR_CALIB in the MPDDRC_MCFGR register */
#define MPDDRC_MCFGR_INFO_Pos                 _UINT32_(11)                                         /* (MPDDRC_MCFGR) Information Type Position */
#define MPDDRC_MCFGR_INFO_Msk                 (_UINT32_(0x3) << MPDDRC_MCFGR_INFO_Pos)             /* (MPDDRC_MCFGR) Information Type Mask */
#define MPDDRC_MCFGR_INFO(value)              (MPDDRC_MCFGR_INFO_Msk & (_UINT32_(value) << MPDDRC_MCFGR_INFO_Pos)) /* Assigment of value for INFO in the MPDDRC_MCFGR register */
#define   MPDDRC_MCFGR_INFO_MAX_WAIT_Val      _UINT32_(0x0)                                        /* (MPDDRC_MCFGR) Information concerning the transfer with the longest waiting time  */
#define   MPDDRC_MCFGR_INFO_NB_TRANSFERS_Val  _UINT32_(0x1)                                        /* (MPDDRC_MCFGR) Number of transfers on the port  */
#define   MPDDRC_MCFGR_INFO_TOTAL_LATENCY_Val _UINT32_(0x2)                                        /* (MPDDRC_MCFGR) Total latency on the port  */
#define MPDDRC_MCFGR_INFO_MAX_WAIT            (MPDDRC_MCFGR_INFO_MAX_WAIT_Val << MPDDRC_MCFGR_INFO_Pos) /* (MPDDRC_MCFGR) Information concerning the transfer with the longest waiting time Position  */
#define MPDDRC_MCFGR_INFO_NB_TRANSFERS        (MPDDRC_MCFGR_INFO_NB_TRANSFERS_Val << MPDDRC_MCFGR_INFO_Pos) /* (MPDDRC_MCFGR) Number of transfers on the port Position  */
#define MPDDRC_MCFGR_INFO_TOTAL_LATENCY       (MPDDRC_MCFGR_INFO_TOTAL_LATENCY_Val << MPDDRC_MCFGR_INFO_Pos) /* (MPDDRC_MCFGR) Total latency on the port Position  */
#define MPDDRC_MCFGR_Msk                      _UINT32_(0x00001F13)                                 /* (MPDDRC_MCFGR) Register Mask  */


/* -------- MPDDRC_MADDR0 : (MPDDRC Offset: 0x64) (R/W 32) Monitor Address High/Low Port 0 Register -------- */
#define MPDDRC_MADDR0_ADDR_LOW_PORT0_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR0) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR0_ADDR_LOW_PORT0_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR0_ADDR_LOW_PORT0_Pos) /* (MPDDRC_MADDR0) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR0_ADDR_LOW_PORT0(value)   (MPDDRC_MADDR0_ADDR_LOW_PORT0_Msk & (_UINT32_(value) << MPDDRC_MADDR0_ADDR_LOW_PORT0_Pos)) /* Assigment of value for ADDR_LOW_PORT0 in the MPDDRC_MADDR0 register */
#define MPDDRC_MADDR0_ADDR_HIGH_PORT0_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR0) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR0_ADDR_HIGH_PORT0_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR0_ADDR_HIGH_PORT0_Pos) /* (MPDDRC_MADDR0) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR0_ADDR_HIGH_PORT0(value)  (MPDDRC_MADDR0_ADDR_HIGH_PORT0_Msk & (_UINT32_(value) << MPDDRC_MADDR0_ADDR_HIGH_PORT0_Pos)) /* Assigment of value for ADDR_HIGH_PORT0 in the MPDDRC_MADDR0 register */
#define MPDDRC_MADDR0_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR0) Register Mask  */


/* -------- MPDDRC_MADDR1 : (MPDDRC Offset: 0x68) (R/W 32) Monitor Address High/Low Port 1 Register -------- */
#define MPDDRC_MADDR1_ADDR_LOW_PORT1_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR1) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR1_ADDR_LOW_PORT1_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR1_ADDR_LOW_PORT1_Pos) /* (MPDDRC_MADDR1) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR1_ADDR_LOW_PORT1(value)   (MPDDRC_MADDR1_ADDR_LOW_PORT1_Msk & (_UINT32_(value) << MPDDRC_MADDR1_ADDR_LOW_PORT1_Pos)) /* Assigment of value for ADDR_LOW_PORT1 in the MPDDRC_MADDR1 register */
#define MPDDRC_MADDR1_ADDR_HIGH_PORT1_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR1) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR1_ADDR_HIGH_PORT1_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR1_ADDR_HIGH_PORT1_Pos) /* (MPDDRC_MADDR1) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR1_ADDR_HIGH_PORT1(value)  (MPDDRC_MADDR1_ADDR_HIGH_PORT1_Msk & (_UINT32_(value) << MPDDRC_MADDR1_ADDR_HIGH_PORT1_Pos)) /* Assigment of value for ADDR_HIGH_PORT1 in the MPDDRC_MADDR1 register */
#define MPDDRC_MADDR1_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR1) Register Mask  */


/* -------- MPDDRC_MADDR2 : (MPDDRC Offset: 0x6C) (R/W 32) Monitor Address High/Low Port 2 Register -------- */
#define MPDDRC_MADDR2_ADDR_LOW_PORT2_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR2) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR2_ADDR_LOW_PORT2_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR2_ADDR_LOW_PORT2_Pos) /* (MPDDRC_MADDR2) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR2_ADDR_LOW_PORT2(value)   (MPDDRC_MADDR2_ADDR_LOW_PORT2_Msk & (_UINT32_(value) << MPDDRC_MADDR2_ADDR_LOW_PORT2_Pos)) /* Assigment of value for ADDR_LOW_PORT2 in the MPDDRC_MADDR2 register */
#define MPDDRC_MADDR2_ADDR_HIGH_PORT2_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR2) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR2_ADDR_HIGH_PORT2_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR2_ADDR_HIGH_PORT2_Pos) /* (MPDDRC_MADDR2) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR2_ADDR_HIGH_PORT2(value)  (MPDDRC_MADDR2_ADDR_HIGH_PORT2_Msk & (_UINT32_(value) << MPDDRC_MADDR2_ADDR_HIGH_PORT2_Pos)) /* Assigment of value for ADDR_HIGH_PORT2 in the MPDDRC_MADDR2 register */
#define MPDDRC_MADDR2_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR2) Register Mask  */


