Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/mpddrc.h
/* -------- MPDDRC_MADDR3 : (MPDDRC Offset: 0x70) (R/W 32) Monitor Address High/Low Port 3 Register -------- */
#define MPDDRC_MADDR3_ADDR_LOW_PORT3_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR3) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR3_ADDR_LOW_PORT3_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR3_ADDR_LOW_PORT3_Pos) /* (MPDDRC_MADDR3) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR3_ADDR_LOW_PORT3(value)   (MPDDRC_MADDR3_ADDR_LOW_PORT3_Msk & (_UINT32_(value) << MPDDRC_MADDR3_ADDR_LOW_PORT3_Pos)) /* Assigment of value for ADDR_LOW_PORT3 in the MPDDRC_MADDR3 register */
#define MPDDRC_MADDR3_ADDR_HIGH_PORT3_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR3) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR3_ADDR_HIGH_PORT3_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR3_ADDR_HIGH_PORT3_Pos) /* (MPDDRC_MADDR3) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR3_ADDR_HIGH_PORT3(value)  (MPDDRC_MADDR3_ADDR_HIGH_PORT3_Msk & (_UINT32_(value) << MPDDRC_MADDR3_ADDR_HIGH_PORT3_Pos)) /* Assigment of value for ADDR_HIGH_PORT3 in the MPDDRC_MADDR3 register */
#define MPDDRC_MADDR3_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR3) Register Mask  */


/* -------- MPDDRC_MADDR4 : (MPDDRC Offset: 0x74) (R/W 32) Monitor Address High/Low Port 4 Register -------- */
#define MPDDRC_MADDR4_ADDR_LOW_PORT4_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR4) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR4_ADDR_LOW_PORT4_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR4_ADDR_LOW_PORT4_Pos) /* (MPDDRC_MADDR4) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR4_ADDR_LOW_PORT4(value)   (MPDDRC_MADDR4_ADDR_LOW_PORT4_Msk & (_UINT32_(value) << MPDDRC_MADDR4_ADDR_LOW_PORT4_Pos)) /* Assigment of value for ADDR_LOW_PORT4 in the MPDDRC_MADDR4 register */
#define MPDDRC_MADDR4_ADDR_HIGH_PORT4_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR4) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR4_ADDR_HIGH_PORT4_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR4_ADDR_HIGH_PORT4_Pos) /* (MPDDRC_MADDR4) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR4_ADDR_HIGH_PORT4(value)  (MPDDRC_MADDR4_ADDR_HIGH_PORT4_Msk & (_UINT32_(value) << MPDDRC_MADDR4_ADDR_HIGH_PORT4_Pos)) /* Assigment of value for ADDR_HIGH_PORT4 in the MPDDRC_MADDR4 register */
#define MPDDRC_MADDR4_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR4) Register Mask  */


/* -------- MPDDRC_MADDR5 : (MPDDRC Offset: 0x78) (R/W 32) Monitor Address High/Low Port 5 Register -------- */
#define MPDDRC_MADDR5_ADDR_LOW_PORT5_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR5) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR5_ADDR_LOW_PORT5_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR5_ADDR_LOW_PORT5_Pos) /* (MPDDRC_MADDR5) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR5_ADDR_LOW_PORT5(value)   (MPDDRC_MADDR5_ADDR_LOW_PORT5_Msk & (_UINT32_(value) << MPDDRC_MADDR5_ADDR_LOW_PORT5_Pos)) /* Assigment of value for ADDR_LOW_PORT5 in the MPDDRC_MADDR5 register */
#define MPDDRC_MADDR5_ADDR_HIGH_PORT5_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR5) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR5_ADDR_HIGH_PORT5_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR5_ADDR_HIGH_PORT5_Pos) /* (MPDDRC_MADDR5) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR5_ADDR_HIGH_PORT5(value)  (MPDDRC_MADDR5_ADDR_HIGH_PORT5_Msk & (_UINT32_(value) << MPDDRC_MADDR5_ADDR_HIGH_PORT5_Pos)) /* Assigment of value for ADDR_HIGH_PORT5 in the MPDDRC_MADDR5 register */
#define MPDDRC_MADDR5_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR5) Register Mask  */


/* -------- MPDDRC_MADDR6 : (MPDDRC Offset: 0x7C) (R/W 32) Monitor Address High/Low Port 6 Register -------- */
#define MPDDRC_MADDR6_ADDR_LOW_PORT6_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR6) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR6_ADDR_LOW_PORT6_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR6_ADDR_LOW_PORT6_Pos) /* (MPDDRC_MADDR6) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR6_ADDR_LOW_PORT6(value)   (MPDDRC_MADDR6_ADDR_LOW_PORT6_Msk & (_UINT32_(value) << MPDDRC_MADDR6_ADDR_LOW_PORT6_Pos)) /* Assigment of value for ADDR_LOW_PORT6 in the MPDDRC_MADDR6 register */
#define MPDDRC_MADDR6_ADDR_HIGH_PORT6_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR6) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR6_ADDR_HIGH_PORT6_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR6_ADDR_HIGH_PORT6_Pos) /* (MPDDRC_MADDR6) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR6_ADDR_HIGH_PORT6(value)  (MPDDRC_MADDR6_ADDR_HIGH_PORT6_Msk & (_UINT32_(value) << MPDDRC_MADDR6_ADDR_HIGH_PORT6_Pos)) /* Assigment of value for ADDR_HIGH_PORT6 in the MPDDRC_MADDR6 register */
#define MPDDRC_MADDR6_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR6) Register Mask  */


/* -------- MPDDRC_MADDR7 : (MPDDRC Offset: 0x80) (R/W 32) Monitor Address High/Low Port 7 Register -------- */
#define MPDDRC_MADDR7_ADDR_LOW_PORT7_Pos      _UINT32_(0)                                          /* (MPDDRC_MADDR7) Address Low on Port x [x = 0..7] Position */
#define MPDDRC_MADDR7_ADDR_LOW_PORT7_Msk      (_UINT32_(0xFFFF) << MPDDRC_MADDR7_ADDR_LOW_PORT7_Pos) /* (MPDDRC_MADDR7) Address Low on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR7_ADDR_LOW_PORT7(value)   (MPDDRC_MADDR7_ADDR_LOW_PORT7_Msk & (_UINT32_(value) << MPDDRC_MADDR7_ADDR_LOW_PORT7_Pos)) /* Assigment of value for ADDR_LOW_PORT7 in the MPDDRC_MADDR7 register */
#define MPDDRC_MADDR7_ADDR_HIGH_PORT7_Pos     _UINT32_(16)                                         /* (MPDDRC_MADDR7) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MADDR7_ADDR_HIGH_PORT7_Msk     (_UINT32_(0xFFFF) << MPDDRC_MADDR7_ADDR_HIGH_PORT7_Pos) /* (MPDDRC_MADDR7) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MADDR7_ADDR_HIGH_PORT7(value)  (MPDDRC_MADDR7_ADDR_HIGH_PORT7_Msk & (_UINT32_(value) << MPDDRC_MADDR7_ADDR_HIGH_PORT7_Pos)) /* Assigment of value for ADDR_HIGH_PORT7 in the MPDDRC_MADDR7 register */
#define MPDDRC_MADDR7_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (MPDDRC_MADDR7) Register Mask  */


/* -------- MPDDRC_MINFO0 : (MPDDRC Offset: 0x84) ( R/ 32) Monitor Information Port 0 Register -------- */
#define MPDDRC_MINFO0_Msk                     _UINT32_(0x00000000)                                 /* (MPDDRC_MINFO0) Register Mask  */

