Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/mpddrc.h
/* -------- MPDDRC_MINFO7 : (MPDDRC Offset: 0xA0) ( R/ 32) Monitor Information Port 7 Register -------- */
#define MPDDRC_MINFO7_Msk                     _UINT32_(0x00000000)                                 /* (MPDDRC_MINFO7) Register Mask  */

/* MAX_WAIT mode */
#define MPDDRC_MINFO7_MAX_WAIT_MAX_PORT7_WAITING_Pos _UINT32_(0)                                          /* (MPDDRC_MINFO7) Address High on Port x [x = 0..7] Position */
#define MPDDRC_MINFO7_MAX_WAIT_MAX_PORT7_WAITING_Msk (_UINT32_(0xFFFF) << MPDDRC_MINFO7_MAX_WAIT_MAX_PORT7_WAITING_Pos) /* (MPDDRC_MINFO7) Address High on Port x [x = 0..7] Mask */
#define MPDDRC_MINFO7_MAX_WAIT_MAX_PORT7_WAITING(value) (MPDDRC_MINFO7_MAX_WAIT_MAX_PORT7_WAITING_Msk & (_UINT32_(value) << MPDDRC_MINFO7_MAX_WAIT_MAX_PORT7_WAITING_Pos))
#define MPDDRC_MINFO7_MAX_WAIT_BURST_Pos      _UINT32_(16)                                         /* (MPDDRC_MINFO7) Type of Burst on Port x [x = 0..7] Position */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_Msk      (_UINT32_(0x7) << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos)  /* (MPDDRC_MINFO7) Type of Burst on Port x [x = 0..7] Mask */
#define MPDDRC_MINFO7_MAX_WAIT_BURST(value)   (MPDDRC_MINFO7_MAX_WAIT_BURST_Msk & (_UINT32_(value) << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos))
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_SINGLE_Val _UINT32_(0x0)                                        /* (MPDDRC_MINFO7) Single transfer  */
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_INCR_Val _UINT32_(0x1)                                        /* (MPDDRC_MINFO7) Incrementing burst of unspecified length  */
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP4_Val _UINT32_(0x2)                                        /* (MPDDRC_MINFO7) 4-beat wrapping burst  */
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_INCR4_Val _UINT32_(0x3)                                        /* (MPDDRC_MINFO7) 4-beat incrementing burst  */
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP8_Val _UINT32_(0x4)                                        /* (MPDDRC_MINFO7) 8-beat wrapping burst  */
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_INCR8_Val _UINT32_(0x5)                                        /* (MPDDRC_MINFO7) 8-beat incrementing burst  */
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP16_Val _UINT32_(0x6)                                        /* (MPDDRC_MINFO7) 16-beat wrapping burst  */
#define   MPDDRC_MINFO7_MAX_WAIT_BURST_INCR16_Val _UINT32_(0x7)                                        /* (MPDDRC_MINFO7) 16-beat incrementing burst  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_SINGLE   (MPDDRC_MINFO7_MAX_WAIT_BURST_SINGLE_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) Single transfer Position  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_INCR     (MPDDRC_MINFO7_MAX_WAIT_BURST_INCR_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) Incrementing burst of unspecified length Position  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP4    (MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP4_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) 4-beat wrapping burst Position  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_INCR4    (MPDDRC_MINFO7_MAX_WAIT_BURST_INCR4_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) 4-beat incrementing burst Position  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP8    (MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP8_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) 8-beat wrapping burst Position  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_INCR8    (MPDDRC_MINFO7_MAX_WAIT_BURST_INCR8_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) 8-beat incrementing burst Position  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP16   (MPDDRC_MINFO7_MAX_WAIT_BURST_WRAP16_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) 16-beat wrapping burst Position  */
#define MPDDRC_MINFO7_MAX_WAIT_BURST_INCR16   (MPDDRC_MINFO7_MAX_WAIT_BURST_INCR16_Val << MPDDRC_MINFO7_MAX_WAIT_BURST_Pos) /* (MPDDRC_MINFO7) 16-beat incrementing burst Position  */
#define MPDDRC_MINFO7_MAX_WAIT_SIZE_Pos       _UINT32_(20)                                         /* (MPDDRC_MINFO7) Transfer Size on Port x [x = 0..7] Position */
#define MPDDRC_MINFO7_MAX_WAIT_SIZE_Msk       (_UINT32_(0x7) << MPDDRC_MINFO7_MAX_WAIT_SIZE_Pos)   /* (MPDDRC_MINFO7) Transfer Size on Port x [x = 0..7] Mask */
#define MPDDRC_MINFO7_MAX_WAIT_SIZE(value)    (MPDDRC_MINFO7_MAX_WAIT_SIZE_Msk & (_UINT32_(value) << MPDDRC_MINFO7_MAX_WAIT_SIZE_Pos))
#define   MPDDRC_MINFO7_MAX_WAIT_SIZE_8BITS_Val _UINT32_(0x0)                                        /* (MPDDRC_MINFO7) Byte transfer  */
#define   MPDDRC_MINFO7_MAX_WAIT_SIZE_16BITS_Val _UINT32_(0x1)                                        /* (MPDDRC_MINFO7) Halfword transfer  */
#define   MPDDRC_MINFO7_MAX_WAIT_SIZE_32BITS_Val _UINT32_(0x2)                                        /* (MPDDRC_MINFO7) Word transfer  */
#define   MPDDRC_MINFO7_MAX_WAIT_SIZE_64BITS_Val _UINT32_(0x3)                                        /* (MPDDRC_MINFO7) Dword transfer  */
#define MPDDRC_MINFO7_MAX_WAIT_SIZE_8BITS     (MPDDRC_MINFO7_MAX_WAIT_SIZE_8BITS_Val << MPDDRC_MINFO7_MAX_WAIT_SIZE_Pos) /* (MPDDRC_MINFO7) Byte transfer Position  */
#define MPDDRC_MINFO7_MAX_WAIT_SIZE_16BITS    (MPDDRC_MINFO7_MAX_WAIT_SIZE_16BITS_Val << MPDDRC_MINFO7_MAX_WAIT_SIZE_Pos) /* (MPDDRC_MINFO7) Halfword transfer Position  */
#define MPDDRC_MINFO7_MAX_WAIT_SIZE_32BITS    (MPDDRC_MINFO7_MAX_WAIT_SIZE_32BITS_Val << MPDDRC_MINFO7_MAX_WAIT_SIZE_Pos) /* (MPDDRC_MINFO7) Word transfer Position  */
#define MPDDRC_MINFO7_MAX_WAIT_SIZE_64BITS    (MPDDRC_MINFO7_MAX_WAIT_SIZE_64BITS_Val << MPDDRC_MINFO7_MAX_WAIT_SIZE_Pos) /* (MPDDRC_MINFO7) Dword transfer Position  */
#define MPDDRC_MINFO7_MAX_WAIT_READ_WRITE_Pos _UINT32_(24)                                         /* (MPDDRC_MINFO7) Read or Write Access on Port x [x = 0..7] Position */
#define MPDDRC_MINFO7_MAX_WAIT_READ_WRITE_Msk (_UINT32_(0x1) << MPDDRC_MINFO7_MAX_WAIT_READ_WRITE_Pos) /* (MPDDRC_MINFO7) Read or Write Access on Port x [x = 0..7] Mask */
#define MPDDRC_MINFO7_MAX_WAIT_READ_WRITE(value) (MPDDRC_MINFO7_MAX_WAIT_READ_WRITE_Msk & (_UINT32_(value) << MPDDRC_MINFO7_MAX_WAIT_READ_WRITE_Pos))
#define MPDDRC_MINFO7_MAX_WAIT_Msk            _UINT32_(0x0177FFFF)                                  /* (MPDDRC_MINFO7_MAX_WAIT) Register Mask  */

/* NB_TRANSFERS mode */
#define MPDDRC_MINFO7_NB_TRANSFERS_P7_NB_TRANSFERS_Pos _UINT32_(0)                                          /* (MPDDRC_MINFO7) Number of Transfers on Port x [x = 0..7] Position */
#define MPDDRC_MINFO7_NB_TRANSFERS_P7_NB_TRANSFERS_Msk (_UINT32_(0xFFFFFFFF) << MPDDRC_MINFO7_NB_TRANSFERS_P7_NB_TRANSFERS_Pos) /* (MPDDRC_MINFO7) Number of Transfers on Port x [x = 0..7] Mask */
#define MPDDRC_MINFO7_NB_TRANSFERS_P7_NB_TRANSFERS(value) (MPDDRC_MINFO7_NB_TRANSFERS_P7_NB_TRANSFERS_Msk & (_UINT32_(value) << MPDDRC_MINFO7_NB_TRANSFERS_P7_NB_TRANSFERS_Pos))
#define MPDDRC_MINFO7_NB_TRANSFERS_Msk        _UINT32_(0xFFFFFFFF)                                  /* (MPDDRC_MINFO7_NB_TRANSFERS) Register Mask  */

/* TOTAL_LATENCY mode */
#define MPDDRC_MINFO7_TOTAL_LATENCY_P7_TOTAL_LATENCY_Pos _UINT32_(0)                                          /* (MPDDRC_MINFO7) Total Latency on Port x [x = 0..7] Position */
#define MPDDRC_MINFO7_TOTAL_LATENCY_P7_TOTAL_LATENCY_Msk (_UINT32_(0xFFFFFFFF) << MPDDRC_MINFO7_TOTAL_LATENCY_P7_TOTAL_LATENCY_Pos) /* (MPDDRC_MINFO7) Total Latency on Port x [x = 0..7] Mask */
#define MPDDRC_MINFO7_TOTAL_LATENCY_P7_TOTAL_LATENCY(value) (MPDDRC_MINFO7_TOTAL_LATENCY_P7_TOTAL_LATENCY_Msk & (_UINT32_(value) << MPDDRC_MINFO7_TOTAL_LATENCY_P7_TOTAL_LATENCY_Pos))
#define MPDDRC_MINFO7_TOTAL_LATENCY_Msk       _UINT32_(0xFFFFFFFF)                                  /* (MPDDRC_MINFO7_TOTAL_LATENCY) Register Mask  */


/* -------- MPDDRC_WPMR : (MPDDRC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define MPDDRC_WPMR_WPEN_Pos                  _UINT32_(0)                                          /* (MPDDRC_WPMR) Write Protection Enable Position */
#define MPDDRC_WPMR_WPEN_Msk                  (_UINT32_(0x1) << MPDDRC_WPMR_WPEN_Pos)              /* (MPDDRC_WPMR) Write Protection Enable Mask */
#define MPDDRC_WPMR_WPEN(value)               (MPDDRC_WPMR_WPEN_Msk & (_UINT32_(value) << MPDDRC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the MPDDRC_WPMR register */
#define MPDDRC_WPMR_WPKEY_Pos                 _UINT32_(8)                                          /* (MPDDRC_WPMR) Write Protection Key Position */
#define MPDDRC_WPMR_WPKEY_Msk                 (_UINT32_(0xFFFFFF) << MPDDRC_WPMR_WPKEY_Pos)        /* (MPDDRC_WPMR) Write Protection Key Mask */
#define MPDDRC_WPMR_WPKEY(value)              (MPDDRC_WPMR_WPKEY_Msk & (_UINT32_(value) << MPDDRC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the MPDDRC_WPMR register */
#define   MPDDRC_WPMR_WPKEY_PASSWD_Val        _UINT32_(0x444452)                                   /* (MPDDRC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define MPDDRC_WPMR_WPKEY_PASSWD              (MPDDRC_WPMR_WPKEY_PASSWD_Val << MPDDRC_WPMR_WPKEY_Pos) /* (MPDDRC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define MPDDRC_WPMR_Msk                       _UINT32_(0xFFFFFF01)                                 /* (MPDDRC_WPMR) Register Mask  */


/* -------- MPDDRC_WPSR : (MPDDRC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define MPDDRC_WPSR_WPVS_Pos                  _UINT32_(0)                                          /* (MPDDRC_WPSR) Write Protection Enable Position */
#define MPDDRC_WPSR_WPVS_Msk                  (_UINT32_(0x1) << MPDDRC_WPSR_WPVS_Pos)              /* (MPDDRC_WPSR) Write Protection Enable Mask */
#define MPDDRC_WPSR_WPVS(value)               (MPDDRC_WPSR_WPVS_Msk & (_UINT32_(value) << MPDDRC_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the MPDDRC_WPSR register */
#define MPDDRC_WPSR_WPVSRC_Pos                _UINT32_(8)                                          /* (MPDDRC_WPSR) Write Protection Violation Source Position */
#define MPDDRC_WPSR_WPVSRC_Msk                (_UINT32_(0xFFFF) << MPDDRC_WPSR_WPVSRC_Pos)         /* (MPDDRC_WPSR) Write Protection Violation Source Mask */
#define MPDDRC_WPSR_WPVSRC(value)             (MPDDRC_WPSR_WPVSRC_Msk & (_UINT32_(value) << MPDDRC_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the MPDDRC_WPSR register */
#define MPDDRC_WPSR_Msk                       _UINT32_(0x00FFFF01)                                 /* (MPDDRC_WPSR) Register Mask  */


